{
  "name": "Sekolah Menengah Sains Miri (SAINSRI)",
  "provider": "Ministry of Education Malaysia",
  "description": "Sekolah Menengah Sains Miri, known as SAINSRI, is a premier government Sekolah Berasrama Penuh (SBP) in Miri, Sarawak, offering Form 1-5 secondary education (ages 13-17) leading to SPM certification. As the flagship science school in Sarawak's northern region, SAINSRI provides comprehensive boarding facilities and structured academic programs designed to nurture STEM excellence among students from diverse backgrounds. The school is highly subsidized by the Malaysian government, with minimal fees ensuring quality boarding education remains accessible to B40 and M40 families across northern Sarawak. Strategically located in Miri, Malaysia's petroleum hub, SAINSRI serves students from surrounding divisions including Limbang, Bintulu, and rural interior regions, providing crucial access to quality science education for communities often challenged by geographical distance and limited educational resources. The school features state-of-the-art science laboratories, modern technology centers, well-equipped mathematics facilities, and specialized equipment for practical work in physics, chemistry, biology, and environmental science. Students benefit from experienced educators, innovative teaching methodologies, and extensive co-curricular programs including science olympiads, robotics competitions, coding clubs, environmental conservation projects, sports, uniformed bodies, and cultural activities celebrating Sarawak's multicultural society. The boarding environment instills discipline, resilience, and collaborative skills while providing supportive community for students far from home. SAINSRI particularly emphasizes scientific inquiry and environmental awareness, given Miri's unique position as both an industrial center and gateway to important rainforest ecosystems. The school provides strong support systems to help students from longhouse communities and rural areas adapt to urban boarding life while maintaining their cultural identities. Many students overcome significant geographical isolation and economic constraints to pursue their educational dreams at SAINSRI. Admission is competitive, based on primary school academic performance, co-curricular achievements, and interview assessments. Applications for Form 1 admission open annually through https://spskt1.moe.gov.my (typically January-February). SAINSRI graduates consistently achieve outstanding SPM results and gain admission to top Form 6 programs, matriculation courses, and diploma programs, with many proceeding to Malaysian public universities in STEM, petroleum engineering, medical, and environmental science fields.",
  "url": "https://sainsri.edu.my",
  "category": "secondary-education",
  "incomeGroups": ["B40", "M40"],
  "cost": "subsidized",
  "mode": "in-person",
  "language": ["ms", "en"],
  "tags": ["boarding-school", "government", "sbp", "science-school", "sarawak", "east-malaysia"],
  "featured": false,
  "educationLevel": ["secondary"]
}
