{
  "name": "Sekolah Menengah Sains Teluk Intan (SEMESTI)",
  "provider": "Ministry of Education Malaysia",
  "description": "Sekolah Menengah Sains Teluk Intan in Teluk Intan, Perak is a government Sekolah Berasrama Penuh (SBP) offering Form 1-5 secondary education (ages 13-17) leading to SPM certification. As a fully residential school, SEMESTI provides comprehensive boarding facilities and structured environment promoting academic excellence, character development, and independence. The school is highly subsidized by the Malaysian government, with minimal fees making quality boarding education accessible to B40 and M40 families. Specializing in STEM education, the school features advanced science laboratories, mathematics resource centers, and specialized equipment for physics, chemistry, and biology practical work. Students benefit from experienced science educators, modern facilities, and extensive co-curricular programs including science clubs, robotics competitions, mathematics challenges, sports, uniformed bodies, and cultural activities. The boarding system instills discipline, time management, and collaborative skills essential for future success. Located in Teluk Intan, Hilir Perak, SEMESTI serves students from southern Perak and provides quality science education in a boarding environment. The school emphasizes hands-on learning and scientific investigation to nurture critical thinking and problem-solving abilities essential for STEM careers. Admission is competitive, based on primary school academic performance (formerly UPSR), co-curricular achievements, and interview assessments. Applications for Form 1 admission open annually through https://spskt1.moe.gov.my (typically January-February). SEMESTI graduates consistently gain admission to top Form 6 programs, matriculation, and diploma courses, with many proceeding to Malaysian public universities in STEM fields.",
  "url": "https://semesti.edu.my",
  "category": "secondary-education",
  "incomeGroups": ["B40", "M40"],
  "cost": "subsidized",
  "mode": "in-person",
  "language": ["ms", "en"],
  "tags": ["boarding-school", "government", "sbp", "science-school", "perak"],
  "featured": false,
  "educationLevel": ["secondary"]
}
