{
  "name": "Sekolah Menengah Sains Seri Puteri, Sentul (SESERI)",
  "provider": "Ministry of Education Malaysia",
  "description": "Sekolah Menengah Sains Seri Puteri (SESERI) in Sentul, Kuala Lumpur is a government Sekolah Berasrama Penuh (SBP) offering Form 1-5 secondary education (ages 13-17) leading to SPM certification with specialized focus on science and STEM education for girls. As a fully residential girls' science school, SESERI provides comprehensive boarding facilities and structured environment promoting academic excellence, scientific inquiry, innovation, and female empowerment in STEM fields. The school is highly subsidized by the Malaysian government, with minimal fees making quality science boarding education accessible to B40 and M40 families. SESERI specializes in developing future female scientists, engineers, and STEM professionals through intensive science and mathematics curriculum emphasizing hands-on laboratory work, scientific research, problem-solving, and critical thinking. The school creates a supportive environment specifically designed to encourage and nurture girls' interest and confidence in traditionally male-dominated STEM fields. Well-equipped science laboratories, computer facilities, and research resources enable students to conduct experiments and develop practical scientific skills. Advanced courses in Physics, Chemistry, Biology, Mathematics, and Additional Mathematics prepare students for competitive STEM careers and university programs. The curriculum integrates theoretical knowledge with practical applications, encouraging innovation, creativity, and scientific reasoning. Students benefit from experienced science teachers who serve as role models, modern facilities, and extensive co-curricular programs including science clubs, robotics, coding, mathematics competitions, and research projects tailored to empower young women in STEM. Participation in national and international science competitions provides opportunities to showcase scientific talents. The girls-only boarding environment fosters strong sisterhood bonds, leadership development, mutual support, and confidence-building. The boarding system instills discipline, time management, and collaborative skills essential for future success in scientific fields. SESERI's STEM-focused environment cultivates scientific curiosity, analytical thinking, and passion for science among young women. Admission is highly competitive, prioritizing female students with strong aptitude and interest in science and mathematics, based on primary school academic performance (formerly UPSR), co-curricular achievements, and interview assessments. Applications for Form 1 admission open annually through https://spskt1.moe.gov.my (typically January-February). SESERI graduates consistently gain admission to top Form 6 science programs, matriculation, A-Levels, and foundation courses, with many proceeding to prestigious Malaysian public universities in STEM fields including engineering, medicine, pharmacy, and pure sciences.",
  "url": "https://seseri.edu.my",
  "category": "secondary-education",
  "incomeGroups": ["B40", "M40"],
  "cost": "subsidized",
  "mode": "in-person",
  "language": ["ms", "en"],
  "tags": ["boarding-school", "government", "sbp", "kuala-lumpur", "science-school", "girls-school"],
  "featured": false,
  "educationLevel": ["secondary"]
}
